app/views/messages/_message.html.erb

    <p><%= message.body %></p>
    <time datetime="<%= message.created_at %>" title="<%= message.created_at.strftime("%d %b  %Y at %I:%M%p") %>">
---
INSERT INTO `messages` (`body`, `conversation_id`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["body", "lkj"], ["conversation_id", 1], ["user_id", 2], ["created_at", "2015-11-19 09:18:41"], ["updated_at", "2015-11-19 09:18:41"]]