app/views/profiles/_form.html.erb

SELECT `timeslots`.* FROM `timeslots`
---
    <div class="col-md-6 col-sm-12">
        <% Timeslot.all.each do |timeslot| %>