app/controllers/conversations_controller.rb

  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id],params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)
---
SELECT  1 AS one FROM `conversations` WHERE (`conversations`.`sender_id` = BINARY 3 AND `conversations`.`recipient_id` = 2) LIMIT 1
SELECT  `conversations`.* FROM `conversations` WHERE ((conversations.sender_id = '2' AND conversations.recipient_id ='3') OR (conversations.sender_id = '3' AND conversations.recipient_id ='2'))  ORDER BY `conversations`.`id` ASC LIMIT 1
INSERT INTO `conversations` (`sender_id`, `recipient_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["sender_id", 3], ["recipient_id", 2], ["created_at", "2015-11-19 08:56:32"], ["updated_at", "2015-11-19 08:56:32"]]

  def check_new_messages
      @messages_from = Hash.new
      @unread_count = 0
      conversations = Conversation.involving(current_user)
      conversations.each do |conversation|
---
SELECT `conversations`.* FROM `conversations` WHERE (conversations.sender_id =2 OR conversations.recipient_id =2)

  def read_messages
    conversation = Conversation.find(params[:conversation_id])
    if conversation.sender_id == current_user.id
        conversation.sender_unread = 0
    else
        conversation.recipient_unread = 0
    end
    conversation.save!
---
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `conversations` SET `sender_unread` = ?, `updated_at` = ? WHERE `conversations`.`id` = ?  [["sender_unread", 0], ["updated_at", "2015-11-19 09:20:20"], ["id", 1]]

  def show
    @conversation = Conversation.find(params[:id])
---
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = ? LIMIT 1  [["id", 1]]