app/controllers/discoveries_controller.rb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = ? LIMIT 1  [["user_id", 2]]
---
	def show
		if current_user.profile.nil?
			redirect_to new_profile_path
			return
		end
		# Rails.cache.delete("#{current_user.profile.city}_#{current_user.profile.post_code}_matches")
		@people = Rails.cache.fetch("#{current_user.profile.city}_#{current_user.profile.post_code}_matches") do
			timeslots = current_user.timeslots
			nearby = Discoveries.instance.findNearbyUsers(current_user.profile.id, 20)