app/controllers/messages_controller.rb

  def create
    @conversation = Conversation.find(params[:conversation_id])
    #set unreader message counter for the message receiver
    if @conversation.sender_id == current_user.id
        unread = @conversation.recipient_unread + 1
        @conversation.update(recipient_unread: unread)
    else
        unread = @conversation.sender_unread + 1
        @conversation.update(sender_unread: unread)
    end
    @message = @conversation.messages.build(message_params)
    @message.user_id = current_user.id
    @message.save!
---
SELECT  `conversations`.* FROM `conversations` WHERE `conversations`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `conversations` SET `recipient_unread` = ?, `updated_at` = ? WHERE `conversations`.`id` = ?  [["recipient_unread", 1], ["updated_at", "2015-11-20 09:20:01"], ["id", 4]]
INSERT INTO `messages` (`body`, `conversation_id`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["body", "lkj"], ["conversation_id", 1], ["user_id", 2], ["created_at", "2015-11-19 09:18:41"], ["updated_at", "2015-11-19 09:18:41"]]