app/controllers/profiles_controller.rb

  def save_gym_information
    place_id = params[:place_id]
    current_user.profile.place_id = place_id
    current_user.profile.save
---
UPDATE `profiles` SET `place_id` = ?, `updated_at` = ? WHERE `profiles`.`id` = ?  [["place_id", "ChIJJ6wxUGe7woAROkPTQga9s-4"], ["updated_at", "2015-11-19 08:55:14"], ["id", 1]]

  def show
    @profile = Profile.find(params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = ? LIMIT 1  [["id", 1]]

  def create
    user = current_user
    ## associated reference doesn't work user.profile return nil
    # if @user.nil?
    #   redirect_to("http://google.com")
    #   return
    # else
    #   redirect_to("http://yahoo.com")
    #   return
    # end
    # @profile = user.profile.build(profile_params)
    @profile = Profile.new(profile_params)
    @profile.user_id = user.id
    if @profile.latitude.nil?
      @profile.latitude = 34.06897
      @profile.longitude = -118.44516
    end
    user_timeslots = params[:time]
    if (user_timeslots == nil)
        user_timeslots = Hash.new
    end
    user_timeslots.default = nil

    for timeslot in Timeslot.all
      if (current_user.timeslots.exists?(timeslot.id) and !user_timeslots[timeslot.id.to_s])
        current_user.timeslots.delete(timeslot.id)
      elsif (user_timeslots[timeslot.id.to_s] and !current_user.timeslots.exists?(timeslot.id))
        current_user.timeslots << timeslot
---
SELECT `timeslots`.* FROM `timeslots`
SELECT  1 AS one FROM `timeslots` INNER JOIN `user_timeslots` ON `timeslots`.`id` = `user_timeslots`.`timeslot_id` WHERE `user_timeslots`.`user_id` = ? AND `timeslots`.`id` = ? LIMIT 1  [["user_id", 2], ["id", 1]]
INSERT INTO `user_timeslots` (`user_id`, `timeslot_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["user_id", 2], ["timeslot_id", 8], ["created_at", "2015-11-19 08:54:54"], ["updated_at", "2015-11-19 08:54:54"]]

    end

    respond_to do |format|
      if @profile.save
---
INSERT INTO `profiles` (`name`, `nick_name`, `add1`, `add2`, `city`, `state`, `post_code`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `user_id`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    profile = current_user.profile
    respond_to do |format|
      user_timeslots = params[:time]
      if (user_timeslots == nil)
          user_timeslots = Hash.new
      end
      user_timeslots.default = nil

      for timeslot in Timeslot.all
        if (current_user.timeslots.exists?(timeslot.id) and !user_timeslots[timeslot.id.to_s])
          current_user.timeslots.delete(timeslot.id)
        elsif (user_timeslots[timeslot.id.to_s] and !current_user.timeslots.exists?(timeslot.id))
          current_user.timeslots << timeslot
        end
      end

      if profile.update(profile_params)
---
SELECT `timeslots`.* FROM `timeslots`
SELECT  1 AS one FROM `timeslots` INNER JOIN `user_timeslots` ON `timeslots`.`id` = `user_timeslots`.`timeslot_id` WHERE `user_timeslots`.`user_id` = ? AND `timeslots`.`id` = ? LIMIT 1  [["user_id", 2], ["id", 1]]
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = ? LIMIT 1  [["user_id", 2]]
INSERT INTO `user_timeslots` (`user_id`, `timeslot_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["user_id", 2], ["timeslot_id", 32], ["created_at", "2015-11-19 09:16:29"], ["updated_at", "2015-11-19 09:16:29"]]
UPDATE `profiles` SET `photo_file_name` = ?, `photo_content_type` = ?, `photo_file_size` = ?, `photo_updated_at` = ?, `updated_at` = ? WHERE `profiles`.`id` = ?